Page({
  data:{
      list: [],
  },
  onReady:function()
  {
    var self = this;

    var list = [
        {
            'img':"../../image/dianpu.jpg",
            'name':'金凤凰大酒店',
            'desc':'我们是做川菜的，很好吃我们是做川菜的，很好吃我们是做川菜的，很好吃我们是做川菜的，很好吃',
            'address':'广州市越秀区中山大道1新龙大夏',
            'id':1,
        },
        {
            'img':"../../image/dianpu.jpg",
            'name':'金凤凰大酒店',
            'desc':'我们是做川菜的，很好吃我们是做川菜的，很好吃我们是做川菜的，很好吃我们是做川菜的，很好吃',
            'address':'广州市越秀区中山大道1新龙大夏',
            'id':1,
        },{
            'img':"../../image/dianpu.jpg",
            'name':'金凤凰大酒店',
            'desc':'我们是做川菜的，很好吃我们是做川菜的，很好吃我们是做川菜的，很好吃我们是做川菜的，很好吃',
            'address':'广州市越秀区中山大道1新龙大夏',
            'id':1,
        },{
            'img':"../../image/dianpu.jpg",
            'name':'金凤凰大酒店',
            'desc':'我们是做川菜的，很好吃我们是做川菜的，很好吃我们是做川菜的，很好吃我们是做川菜的，很好吃',
            'address':'广州市越秀区中山大道1新龙大夏',
            'id':1,
        },{
            'img':"../../image/dianpu.jpg",
            'name':'金凤凰大酒店',
            'desc':'我们是做川菜的，很好吃我们是做川菜的，很好吃我们是做川菜的，很好吃我们是做川菜的，很好吃',
            'address':'广州市越秀区中山大道1新龙大夏',
            'id':1,
        },{
            'img':"../../image/dianpu.jpg",
            'name':'金凤凰大酒店',
            'desc':'我们是做川菜的，很好吃我们是做川菜的，很好吃我们是做川菜的，很好吃我们是做川菜的，很好吃',
            'address':'广州市越秀区中山大道1新龙大夏',
            'id':1,
        }
    ];

    self.setData({
        list:list,
    })
  }
})
